{
    "title": {
        "locales": {
            "en": {
                "title_short": "Experience",
                "title_short_nav": "Experience",
                "title_long_prefix": "Summary of my",
                "title_long": "{{Work}} Experience"
            },
            "es": {
                "title_short": "Experiencia",
                "title_short_nav": "Experiencia",
                "title_long_prefix": "Resumen de mi",
                "title_long": "Experiencia {{Laboral}}"
            }
        }
    },

    "articles": [
        {
            "id": 1,
            "component": "ArticleTimeline",
            "locales": {},
            "settings": {
                "order_items_by": "id",
                "order_items_sort": "asc"
            },
            "items": [
                {
                    "id": 1,
                    "img": "images/pictures/logo-cargaFlow.png",
                    "faIcon": "",
                    "faIconColors": {"bg": "", "fill": ""},
                    "dateStart": {"year": 2026, "month": 1},
                    "dateEnd": {"now": true},
                    "locales": {
                        "en": {
                            "title": "{{Full-Stack}} Mobile Developer",
                            "province": "Buenos Aires",
                            "country": "Argentina",
                            "institution": "CargaFlow",
                            "text": "Mobile logistics and cargo transportation app connecting requesters with drivers in real time. Full development of backend (NestJS, PostgreSQL, Redis) and cross-platform mobile app:",
                            "list": [
                                "Real-time communication with WebSockets (Socket.IO)",
                                "Full-Stack: NestJS + React Native/Expo + PostgreSQL + Redis/Bull",
                                "Geolocation with Google Maps API and live GPS tracking",
                                "Authentication with JWT, refresh tokens, OTP and role-based access",
                                "Dynamic pricing and intelligent proximity-based trip assignment"
                            ],
                            "tags": ["NestJS", "React Native", "PostgreSQL", "Redis", "Socket.IO", "Google Maps"]
                        },
                        "es": {
                            "title": "Desarrollador {{Full-Stack}} Mobile",
                            "province": "Buenos Aires",
                            "country": "Argentina",
                            "institution": "CargaFlow",
                            "text": "Aplicación móvil de logística y transporte de cargas que conecta solicitantes con conductores en tiempo real. Desarrollo integral del backend (NestJS, PostgreSQL, Redis) y app móvil multiplataforma:",
                            "list": [
                                "Comunicación en tiempo real con WebSockets (Socket.IO)",
                                "Full-Stack: NestJS + React Native/Expo + PostgreSQL + Redis/Bull",
                                "Geolocalización con Google Maps API y tracking GPS en vivo",
                                "Autenticación con JWT, refresh tokens, OTP y control de acceso por roles",
                                "Pricing dinámico y asignación inteligente de viajes por proximidad"
                            ],
                            "tags": ["NestJS", "React Native", "PostgreSQL", "Redis", "Socket.IO", "Google Maps"]
                        }
                    }
                },
                {
                    "id": 2,
                    "img": "images/pictures/wallmapu-logo.png",
                    "faIcon": "",
                    "faIconColors": {"bg": "", "fill": ""},
                    "dateStart": {"year": 2025, "month": 11},
                    "dateEnd": {"year": 2026, "month": 2},
                    "locales": {
                        "en": {
                            "title": "{{Full-Stack}} Mobile Developer",
                            "province": "Buenos Aires",
                            "country": "Argentina",
                            "institution": "Wallmapu",
                            "text": "Mobile marketplace app for pet products, built with React Native and Expo. Connects customers with retail and wholesale stores specialized in pet products:",
                            "list": [
                                "Marketplace mobile app development with geolocation using React Native + TypeScript",
                                "Scalable backend implementation with NestJS, PostgreSQL, and Supabase, exposing REST API",
                                "Payment integration with MercadoPago and B2B2C subscription system for local stores",
                                "Administrative CRM with analytical dashboards for store, product, and sales management",
                                "Complete purchase flow with multi-store cart and checkout via WhatsApp"
                            ],
                            "tags": ["React Native", "NestJS", "PostgreSQL", "Supabase", "MercadoPago", "TypeScript"]
                        },
                        "es": {
                            "title": "Desarrollador {{Full-Stack}} Mobile",
                            "province": "Buenos Aires",
                            "country": "Argentina",
                            "institution": "Wallmapu",
                            "text": "Aplicación móvil de marketplace para productos de mascotas, desarrollada con React Native y Expo. Conecta a clientes con tiendas minoristas y mayoristas especializadas en productos para mascotas:",
                            "list": [
                                "Desarrollo de aplicación móvil tipo marketplace con geolocalización utilizando React Native + TypeScript",
                                "Implementación de backend escalable con NestJS, PostgreSQL y Supabase, exponiendo API REST",
                                "Integración de pagos con MercadoPago y sistema de suscripciones B2B2C para tiendas locales",
                                "Construcción de CRM administrativo con dashboards analíticos para gestión de tiendas, productos y ventas",
                                "Flujo completo de compra con carrito multi-tienda y checkout a través de WhatsApp"
                            ],
                            "tags": ["React Native", "NestJS", "PostgreSQL", "Supabase", "MercadoPago", "TypeScript"]
                        }
                    }
                },
                {
                    "id": 3,
                    "img": "images/pictures/play-attention.png",
                    "faIcon": "",
                    "faIconColors": {"bg": "", "fill": ""},
                    "dateStart": {"year": 2025, "month": 4},
                    "dateEnd": {"year": 2025, "month": 5},
                    "locales": {
                        "en": {
                            "title": "{{Project Manager}}",
                            "province": "Buenos Aires",
                            "country": "Argentina",
                            "institution": "Play Attention",
                            "text": "Play Attention is a company specialized in developing [[cognitive training technology]] based on neurofeedback. Functional MVP delivered in just 1 month using Scrum agile methodology:",
                            "list": [
                                "Led a multidisciplinary team of 10 people",
                                "Coordinated tasks, objectives, and on-time sprint deliveries, fostering collaboration between technical profiles using Scrum agile methodology",
                                "Supervised the complete development of a landing page, an admin panel, and a CRM system",
                                "Managed daily meetings (stand-ups) and team blocker resolution",
                                "Focused on delivering functional and scalable solutions within a 1-month MVP deadline"
                            ],
                            "tags": ["Scrum", "Jira", "Leadership", "CRM", "Landing Page"]
                        },
                        "es": {
                            "title": "{{Project Manager}}",
                            "province": "Buenos Aires",
                            "country": "Argentina",
                            "institution": "Play Attention",
                            "text": "Play Attention es una empresa especializada en el desarrollo de [[tecnología de entrenamiento cognitivo]] basada en neurofeedback. MVP funcional entregado en solo 1 mes con metodología ágil Scrum:",
                            "list": [
                                "Lideré un equipo multidisciplinario de 10 personas",
                                "Coordiné tareas, objetivos y entregas en tiempo (sprint), fomentando la colaboración entre perfiles técnicos bajo metodología ágil Scrum",
                                "Supervisé el desarrollo completo de una landing page, un panel administrativo y un sistema CRM",
                                "Gestioné reuniones diarias (stand-ups) y resolución de bloqueos en equipo",
                                "Enfocado en entregar soluciones funcionales y escalables en un plazo de 1 mes para el MVP"
                            ],
                            "tags": ["Scrum", "Jira", "Liderazgo", "CRM", "Landing Page"]
                        }
                    }
                }
            ]
        }
    ]
}